***Ejercicio #1 ***

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv("archivo_practicas.csv")

In [5]:
print(df.head())

   id_empleado       nombre  edad      departamento  salario     ciudad  \
0         1001    Ana Pérez    30          Finanzas     3200     Madrid
1         1002   Luis Gómez    39                IT     4100  Barcelona
2         1003  María López    28  Recursos Humanos     3500   Valencia
3         1004  Carlos Ruiz    35         Marketing     2900    Sevilla
4         1005   Laura Díaz    42                IT     5000     Bilbao

  fecha_ingreso
0    2020-03-15
1    2018-07-10
2    2021-01-20
3    2019-11-05
4    2016-05-13

In [7]:
print(df.shape)

(15, 7)

In [8]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id_empleado    15 non-null     int64
 1   nombre         15 non-null     object
 2   edad           15 non-null     int64
 3   departamento   15 non-null     object
 4   salario        15 non-null     int64
 5   ciudad         15 non-null     object
 6   fecha_ingreso  15 non-null     object
dtypes: int64(3), object(4)
memory usage: 972.0+ bytes
None

In [9]:
display(df.tail())

,id_empleado,nombre,edad,departamento,salario,ciudad,fecha_ingreso
10,1011,Carmen Alonso,37,Finanzas,4100,Madrid,2018-08-19
11,1012,Sergio Castro,41,Logística,3300,Bilbao,2016-10-22
12,1013,Natalia Blanco,34,IT,4700,Málaga,2019-03-12
13,1014,Jorge Ramos,29,Marketing,2900,Valencia,2021-09-14
14,1015,Elena Navarro,36,Recursos Humanos,3600,Sevilla,2017-01-07

In [10]:
print(len(df))

15

*** Ejercicio #2 ***

In [11]:
display(df["departamento"])

0             Finanzas
1                   IT
2     Recursos Humanos
3            Marketing
4                   IT
5             Finanzas
6            Logística
7            Marketing
8                   IT
9     Recursos Humanos
10            Finanzas
11           Logística
12                  IT
13           Marketing
14    Recursos Humanos
Name: departamento, dtype: object

In [12]:
display(df[["departamento","salario"]])

        departamento  salario
0           Finanzas     3200
1                 IT     4100
2   Recursos Humanos     3500
3          Marketing     2900
4                 IT     5000
5           Finanzas     3100
6          Logística     2700
7          Marketing     4600
8                 IT     3800
9   Recursos Humanos     2800
10          Finanzas     4100
11         Logística     3300
12                IT     4700
13         Marketing     2900
14  Recursos Humanos     3600

In [14]:
display(df.iloc[5:9])

,id_empleado,nombre,edad,departamento,salario,ciudad,fecha_ingreso
5,1006,Pedro Sánchez,29,Finanzas,3100,Málaga,2022-02-01
6,1007,Lucía Romero,33,Logística,2700,Madrid,2017-06-18
7,1008,Andrés Torres,45,Marketing,4600,Valencia,2015-09-25
8,1009,Isabel Vargas,31,IT,3800,Barcelona,2020-12-11

*** Ejercicio #4 ***

In [21]:
display(df.loc[df["salario"] > 4000])

,id_empleado,nombre,edad,departamento,salario,ciudad,fecha_ingreso
1,1002,Luis Gómez,39,IT,4100,Barcelona,2018-07-10
4,1005,Laura Díaz,42,IT,5000,Bilbao,2016-05-13
7,1008,Andrés Torres,45,Marketing,4600,Valencia,2015-09-25
10,1011,Carmen Alonso,37,Finanzas,4100,Madrid,2018-08-19
12,1013,Natalia Blanco,34,IT,4700,Málaga,2019-03-12

*** Ejercicio #5 ***

In [22]:
display(df.sort_values("salario"))

,id_empleado,nombre,edad,departamento,salario,ciudad,fecha_ingreso
6,1007,Lucía Romero,33,Logística,2700,Madrid,2017-06-18
9,1010,David Martín,26,Recursos Humanos,2800,Sevilla,2022-06-30
13,1014,Jorge Ramos,29,Marketing,2900,Valencia,2021-09-14
3,1004,Carlos Ruiz,35,Marketing,2900,Sevilla,2019-11-05
5,1006,Pedro Sánchez,29,Finanzas,3100,Málaga,2022-02-01
0,1001,Ana Pérez,30,Finanzas,3200,Madrid,2020-03-15
11,1012,Sergio Castro,41,Logística,3300,Bilbao,2016-10-22
2,1003,María López,28,Recursos Humanos,3500,Valencia,2021-01-20
14,1015,Elena Navarro,36,Recursos Humanos,3600,Sevilla,2017-01-07
8,1009,Isabel Vargas,31,IT,3800,Barcelona,2020-12-11
1,1002,Luis Gómez,39,IT,4100,Barcelona,2018-07-10
10,1011,Carmen Alonso,37,Finanzas,4100,Madrid,2018-08-19
7,1008,Andrés Torres,45,Marketing,4600,Valencia,2015-09-25
12,1013,Natalia Blanco,34,IT,4700,Málaga,2019-03-12
4,1005,Laura Díaz,42,IT,5000,Bilbao,2016-05-13

In [23]:
display(df.sort_values("salario", ascending=False))

,id_empleado,nombre,edad,departamento,salario,ciudad,fecha_ingreso
4,1005,Laura Díaz,42,IT,5000,Bilbao,2016-05-13
12,1013,Natalia Blanco,34,IT,4700,Málaga,2019-03-12
7,1008,Andrés Torres,45,Marketing,4600,Valencia,2015-09-25
1,1002,Luis Gómez,39,IT,4100,Barcelona,2018-07-10
10,1011,Carmen Alonso,37,Finanzas,4100,Madrid,2018-08-19
8,1009,Isabel Vargas,31,IT,3800,Barcelona,2020-12-11
14,1015,Elena Navarro,36,Recursos Humanos,3600,Sevilla,2017-01-07
2,1003,María López,28,Recursos Humanos,3500,Valencia,2021-01-20
11,1012,Sergio Castro,41,Logística,3300,Bilbao,2016-10-22
0,1001,Ana Pérez,30,Finanzas,3200,Madrid,2020-03-15
5,1006,Pedro Sánchez,29,Finanzas,3100,Málaga,2022-02-01
13,1014,Jorge Ramos,29,Marketing,2900,Valencia,2021-09-14
3,1004,Carlos Ruiz,35,Marketing,2900,Sevilla,2019-11-05
9,1010,David Martín,26,Recursos Humanos,2800,Sevilla,2022-06-30
6,1007,Lucía Romero,33,Logística,2700,Madrid,2017-06-18

In [24]:
display(df.sort_values("edad", ascending=False))

,id_empleado,nombre,edad,departamento,salario,ciudad,fecha_ingreso
7,1008,Andrés Torres,45,Marketing,4600,Valencia,2015-09-25
4,1005,Laura Díaz,42,IT,5000,Bilbao,2016-05-13
11,1012,Sergio Castro,41,Logística,3300,Bilbao,2016-10-22
1,1002,Luis Gómez,39,IT,4100,Barcelona,2018-07-10
10,1011,Carmen Alonso,37,Finanzas,4100,Madrid,2018-08-19
14,1015,Elena Navarro,36,Recursos Humanos,3600,Sevilla,2017-01-07
3,1004,Carlos Ruiz,35,Marketing,2900,Sevilla,2019-11-05
12,1013,Natalia Blanco,34,IT,4700,Málaga,2019-03-12
6,1007,Lucía Romero,33,Logística,2700,Madrid,2017-06-18
8,1009,Isabel Vargas,31,IT,3800,Barcelona,2020-12-11
0,1001,Ana Pérez,30,Finanzas,3200,Madrid,2020-03-15
13,1014,Jorge Ramos,29,Marketing,2900,Valencia,2021-09-14
5,1006,Pedro Sánchez,29,Finanzas,3100,Málaga,2022-02-01
2,1003,María López,28,Recursos Humanos,3500,Valencia,2021-01-20
9,1010,David Martín,26,Recursos Humanos,2800,Sevilla,2022-06-30

*** Ordenar por dos columnas: departamento (ascendente) y salario (descendente) ***

In [25]:
display(df.sort_values(["departamento", "salario"], ascending=[True, False]))

,id_empleado,nombre,edad,departamento,salario,ciudad,fecha_ingreso
10,1011,Carmen Alonso,37,Finanzas,4100,Madrid,2018-08-19
0,1001,Ana Pérez,30,Finanzas,3200,Madrid,2020-03-15
5,1006,Pedro Sánchez,29,Finanzas,3100,Málaga,2022-02-01
4,1005,Laura Díaz,42,IT,5000,Bilbao,2016-05-13
12,1013,Natalia Blanco,34,IT,4700,Málaga,2019-03-12
1,1002,Luis Gómez,39,IT,4100,Barcelona,2018-07-10
8,1009,Isabel Vargas,31,IT,3800,Barcelona,2020-12-11
11,1012,Sergio Castro,41,Logística,3300,Bilbao,2016-10-22
6,1007,Lucía Romero,33,Logística,2700,Madrid,2017-06-18
7,1008,Andrés Torres,45,Marketing,4600,Valencia,2015-09-25
3,1004,Carlos Ruiz,35,Marketing,2900,Sevilla,2019-11-05
13,1014,Jorge Ramos,29,Marketing,2900,Valencia,2021-09-14
14,1015,Elena Navarro,36,Recursos Humanos,3600,Sevilla,2017-01-07
2,1003,María López,28,Recursos Humanos,3500,Valencia,2021-01-20
9,1010,David Martín,26,Recursos Humanos,2800,Sevilla,2022-06-30

*** Ejercicio 6 — Estadísticas descriptivas ***

Calcula el promedio de la edad (edad) y compáralo con la mediana de edad.

In [26]:
print("Promedio de edad:", df["edad"].mean(), " | Mediana de edad:", df["edad"].median())

Promedio de edad: 34.333333333333336  | Mediana de edad: 34.0

In [27]:
print("Promedio de edad:", df["edad"].mean(), "| vs |", "Mediana de edad:", df["edad"].median())

Promedio de edad: 34.333333333333336 | vs | Mediana de edad: 34.0

*** Ejercicio #7: Valores nulos ***

In [28]:
df.loc[5, "ciudad"] = None

In [29]:
print(df.isnull().sum())

id_empleado      0
nombre           0
edad             0
departamento     0
salario          0
ciudad           1
fecha_ingreso    0
dtype: int64

In [30]:
display(df.fillna({"ciudad": "Desconocido"}).head(5))

,id_empleado,nombre,edad,departamento,salario,ciudad,fecha_ingreso
0,1001,Ana Pérez,30,Finanzas,3200,Madrid,2020-03-15
1,1002,Luis Gómez,39,IT,4100,Barcelona,2018-07-10
2,1003,María López,28,Recursos Humanos,3500,Valencia,2021-01-20
3,1004,Carlos Ruiz,35,Marketing,2900,Sevilla,2019-11-05
4,1005,Laura Díaz,42,IT,5000,Bilbao,2016-05-13

*** Ejercicio #8 : Duplicados ***

In [31]:
df_con_dup = pd.concat([df, df.iloc[[0]]], ignore_index=True)

In [32]:
print(df_con_dup.duplicated().sum())

1

In [33]:
df_sin_dup = df_con_dup.drop_duplicates()

In [34]:
print(df_sin_dup.duplicated().sum())

0

*** Ejercicio # 9:  Crear nuevas columnas ***

In [35]:
df["edad_5años"] = df["edad"] + 5

In [36]:
display(df.head())

,id_empleado,nombre,edad,departamento,salario,ciudad,fecha_ingreso,edad_5años
0,1001,Ana Pérez,30,Finanzas,3200,Madrid,2020-03-15,35
1,1002,Luis Gómez,39,IT,4100,Barcelona,2018-07-10,44
2,1003,María López,28,Recursos Humanos,3500,Valencia,2021-01-20,33
3,1004,Carlos Ruiz,35,Marketing,2900,Sevilla,2019-11-05,40
4,1005,Laura Díaz,42,IT,5000,Bilbao,2016-05-13,47

*** Ejercicio #10: Conversión de tipos ***

In [37]:
df["edad"] = df["edad"].astype(float)

In [38]:
print(df.dtypes)

id_empleado        int64
nombre            object
edad             float64
departamento      object
salario            int64
ciudad            object
fecha_ingreso     object
edad_5años         int64
dtype: object

*** Ejercicio #11: cambios en fechas ***

In [39]:
df["fecha_ingreso"] = pd.to_datetime(df["fecha_ingreso"])

In [41]:
df["mes_ingreso"] = df ["fecha_ingreso"].dt.month

In [42]:
print(df[["nombre","fecha_ingreso","mes_ingreso"]].head())

        nombre fecha_ingreso  mes_ingreso
0    Ana Pérez    2020-03-15            3
1   Luis Gómez    2018-07-10            7
2  María López    2021-01-20            1
3  Carlos Ruiz    2019-11-05           11
4   Laura Díaz    2016-05-13            5

*** Ejercicio #12: Agrupaciones (groupby) ***

In [43]:
edad_promedio = df.groupby("ciudad")["edad"].mean()

In [44]:
print(edad_promedio)

ciudad
Barcelona    35.000000
Bilbao       41.500000
Madrid       33.333333
Málaga       34.000000
Sevilla      32.333333
Valencia     34.000000
Name: edad, dtype: float64

***Ejercicio 13: Funciones de agregación múltiples***

In [45]:
estadisticas = df.groupby("ciudad")["edad"] .agg(["min", "max", "mean"])

In [46]:
print(estadisticas)

            min   max       mean
ciudad
Barcelona  31.0  39.0  35.000000
Bilbao     41.0  42.0  41.500000
Madrid     30.0  37.0  33.333333
Málaga     34.0  34.0  34.000000
Sevilla    26.0  36.0  32.333333
Valencia   28.0  45.0  34.000000

*** Ejercicio #14: Tablas dinámicas (pivot_table) ***

In [47]:
pivot = pd.pivot_table(df, values="edad",index="departamento",columns="ciudad",aggfunc="mean")

In [48]:
print(pivot)

ciudad            Barcelona  Bilbao  Madrid  Málaga  Sevilla  Valencia
departamento
Finanzas                NaN     NaN    33.5     NaN      NaN       NaN
IT                     35.0    42.0     NaN    34.0      NaN       NaN
Logística               NaN    41.0    33.0     NaN      NaN       NaN
Marketing               NaN     NaN     NaN     NaN     35.0      37.0
Recursos Humanos        NaN     NaN     NaN     NaN     31.0      28.0

*** Ejercicio #15: Uniones (merge) ***

In [50]:
costo_vida = pd.DataFrame({"ciudad":["Málaga", "Santander", "Madrid", "Zaragoza", "Bilbao"],"costo": [1200, 1300, 1000, 1400, 1250]})

In [51]:
df_merged = pd.merge(df, costo_vida, on="ciudad", how="left")

In [52]:
print(df_merged.head())

   id_empleado       nombre  edad      departamento  salario     ciudad  \
0         1001    Ana Pérez  30.0          Finanzas     3200     Madrid
1         1002   Luis Gómez  39.0                IT     4100  Barcelona
2         1003  María López  28.0  Recursos Humanos     3500   Valencia
3         1004  Carlos Ruiz  35.0         Marketing     2900    Sevilla
4         1005   Laura Díaz  42.0                IT     5000     Bilbao

  fecha_ingreso  edad_5años  mes_ingreso   costo
0    2020-03-15          35            3  1000.0
1    2018-07-10          44            7     NaN
2    2021-01-20          33            1     NaN
3    2019-11-05          40           11     NaN
4    2016-05-13          47            5  1250.0

*** Ejercicio #16:  Concatenación de DataFrames (concat) ***

In [53]:
nuevos_empleados = pd.DataFrame({"id_empleado": [4256, 3265], "nombre": ["Francella Rojas", "Wendy Villagra"], "edad": [37, 46], "departamento": ["IT", "Markegting"], "salario": [3000, 2800], "ciudad": ["Santander", "Santander"], "fecha_ingreso": ["2025-08-29", "2025-09-29"]})

In [54]:
df_total = pd.concat([df, nuevos_empleados], ignore_index=True)

In [55]:
print(df_total.tail())

    id_empleado           nombre  edad      departamento  salario     ciudad  \
12         1013   Natalia Blanco  34.0                IT     4700     Málaga
13         1014      Jorge Ramos  29.0         Marketing     2900   Valencia
14         1015    Elena Navarro  36.0  Recursos Humanos     3600    Sevilla
15         4256  Francella Rojas  37.0                IT     3000  Santander
16         3265   Wendy Villagra  46.0        Markegting     2800  Santander

          fecha_ingreso  edad_5años  mes_ingreso
12  2019-03-12 00:00:00        39.0          3.0
13  2021-09-14 00:00:00        34.0          9.0
14  2017-01-07 00:00:00        41.0          1.0
15           2025-08-29         NaN          NaN
16           2025-09-29         NaN          NaN

In [56]:
df_total["departamento"] = df_total["departamento"].replace("Markegting", "Marketing")

In [57]:
print(df_total.tail())

    id_empleado           nombre  edad      departamento  salario     ciudad  \
12         1013   Natalia Blanco  34.0                IT     4700     Málaga
13         1014      Jorge Ramos  29.0         Marketing     2900   Valencia
14         1015    Elena Navarro  36.0  Recursos Humanos     3600    Sevilla
15         4256  Francella Rojas  37.0                IT     3000  Santander
16         3265   Wendy Villagra  46.0         Marketing     2800  Santander

          fecha_ingreso  edad_5años  mes_ingreso
12  2019-03-12 00:00:00        39.0          3.0
13  2021-09-14 00:00:00        34.0          9.0
14  2017-01-07 00:00:00        41.0          1.0
15           2025-08-29         NaN          NaN
16           2025-09-29         NaN          NaN

In [58]:
df_total["edad_5años"] = df_total["edad"] + 5

In [59]:
df_total["fecha_ingreso"] = pd.to_datetime(df_total["fecha_ingreso"])

In [60]:
df_total["mes_ingreso"] = df_total["fecha_ingreso"].dt.month

In [61]:
print(df_total.tail())

    id_empleado           nombre  edad      departamento  salario     ciudad  \
12         1013   Natalia Blanco  34.0                IT     4700     Málaga
13         1014      Jorge Ramos  29.0         Marketing     2900   Valencia
14         1015    Elena Navarro  36.0  Recursos Humanos     3600    Sevilla
15         4256  Francella Rojas  37.0                IT     3000  Santander
16         3265   Wendy Villagra  46.0         Marketing     2800  Santander

   fecha_ingreso  edad_5años  mes_ingreso
12    2019-03-12        39.0            3
13    2021-09-14        34.0            9
14    2017-01-07        41.0            1
15    2025-08-29        42.0            8
16    2025-09-29        51.0            9

*** Ejercicio #17: Aplicar funciones (apply y lambda) ***

In [62]:
df_total["categoria_edad"] = df_total["edad"].apply(
    lambda x: "Senior" if x > 40 else ("Adulto" if x >= 30 else "Joven")
)

In [63]:
print(df_total[["nombre", "edad", "categoria_edad"]].tail())

             nombre  edad categoria_edad
12   Natalia Blanco  34.0         Adulto
13      Jorge Ramos  29.0          Joven
14    Elena Navarro  36.0         Adulto
15  Francella Rojas  37.0         Adulto
16   Wendy Villagra  46.0         Senior

*** Ejercicio #18: Exportación de resultados (to_csv) ***

In [64]:
df_total.to_csv("pandas_practicas_final.csv", index=False)

In [65]:
print("Archivo 'pandas_practicas_final.csv' guardado con éxito.")

Archivo 'pandas_practicas_final.csv' guardado con éxito.

In [66]:
print("pandas_practicas_final.csv")

pandas_practicas_final.csv

*** Ejercicio #19: Indexación avanzada ***

In [67]:
filtro = (df_total["departamento"] == "Marketing") & (df_total["edad"] < 35)

In [68]:
resultado = df_total.loc[filtro, ["nombre", "departamento", "edad"]]

In [69]:
print(resultado)

         nombre departamento  edad
13  Jorge Ramos    Marketing  29.0

*** Ejercicio #20: "Mini Proyecto - Resumen Estadístico ***

In [70]:
print("1. Edad promedio de los empleados:", df_total["edad"].mean())

print("\n2. Empleado más joven:")
print(df_total.loc[df_total["edad"].idxmin(), ["nombre", "edad", "departamento"]])

print("\n3. Empleados por categoría de edad:")
print(df_total["categoria_edad"].value_counts())

1. Edad promedio de los empleados: 35.1764705882353

2. Empleado más joven:
nombre              David Martín
edad                        26.0
departamento    Recursos Humanos
Name: 9, dtype: object

3. Empleados por categoría de edad:
categoria_edad
Adulto    9
Joven     4
Senior    4
Name: count, dtype: int64